# Filter Pandas with strings

## Import Modules

In [1]:
import numpy as np
import pandas as pd

## Review of DataFrames

Let's create the baseball related DataFrame that we worked with last week.

In [2]:
baseball_dict = {'City': ['Pittsburgh', 'Cincinatti', 'Chicago', 'St. Louis', 'Milwaukee'],
                 'Team': ['Pirates', 'Reds', 'Cubs', 'Cardinals', 'Brewers'],
                 'Division': 5 * ['Central'],
                 'League': 5 * ['NL']}

In [3]:
baseball_dict

{'City': ['Pittsburgh', 'Cincinatti', 'Chicago', 'St. Louis', 'Milwaukee'],
 'Team': ['Pirates', 'Reds', 'Cubs', 'Cardinals', 'Brewers'],
 'Division': ['Central', 'Central', 'Central', 'Central', 'Central'],
 'League': ['NL', 'NL', 'NL', 'NL', 'NL']}

In [4]:
baseball_df = pd.DataFrame( baseball_dict,
                            columns=['League', 'Division', 'City', 'Team'])

In [5]:
baseball_df

  League Division        City       Team
0     NL  Central  Pittsburgh    Pirates
1     NL  Central  Cincinatti       Reds
2     NL  Central     Chicago       Cubs
3     NL  Central   St. Louis  Cardinals
4     NL  Central   Milwaukee    Brewers

Add a column for the number of games back.

In [6]:
baseball_df['games_back'] = pd.Series( [31.5, 27.5, 22.5, 0, 7.5],
                                       index=baseball_df.index )

In [7]:
baseball_df

  League Division        City       Team  games_back
0     NL  Central  Pittsburgh    Pirates        31.5
1     NL  Central  Cincinatti       Reds        27.5
2     NL  Central     Chicago       Cubs        22.5
3     NL  Central   St. Louis  Cardinals         0.0
4     NL  Central   Milwaukee    Brewers         7.5

Sort by the `games_back` column. Ignore the index, and modify in place!

In [8]:
baseball_df.sort_values( ['games_back'], ignore_index=True, inplace=True)

In [9]:
baseball_df

  League Division        City       Team  games_back
0     NL  Central   St. Louis  Cardinals         0.0
1     NL  Central   Milwaukee    Brewers         7.5
2     NL  Central     Chicago       Cubs        22.5
3     NL  Central  Cincinatti       Reds        27.5
4     NL  Central  Pittsburgh    Pirates        31.5

Add two more columns that have values which change down the rows.

In [10]:
baseball_df['wins'] = pd.Series([87, 79, 64, 59, 55],
                                index=baseball_df.index)

In [11]:
baseball_df['losses'] = pd.Series([63, 70, 85, 90, 94],
                                  index=baseball_df.index)

In [12]:
baseball_df

  League Division        City       Team  games_back  wins  losses
0     NL  Central   St. Louis  Cardinals         0.0    87      63
1     NL  Central   Milwaukee    Brewers         7.5    79      70
2     NL  Central     Chicago       Cubs        22.5    64      85
3     NL  Central  Cincinatti       Reds        27.5    59      90
4     NL  Central  Pittsburgh    Pirates        31.5    55      94

Lastly, add a column with a constant value down all rows.

In [13]:
baseball_df['season'] = 2022

In [14]:
baseball_df

  League Division        City       Team  games_back  wins  losses  season
0     NL  Central   St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central   Milwaukee    Brewers         7.5    79      70    2022
2     NL  Central     Chicago       Cubs        22.5    64      85    2022
3     NL  Central  Cincinatti       Reds        27.5    59      90    2022
4     NL  Central  Pittsburgh    Pirates        31.5    55      94    2022

## Filter rows

Filtering refers to SELECTING rows based on the CONDITIONAL TESTS.

In [15]:
baseball_df.loc[ baseball_df.wins > 65, : ]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central  Milwaukee    Brewers         7.5    79      70    2022

In [16]:
baseball_df.loc[ baseball_df.Team == 'Pirates', : ]

  League Division        City     Team  games_back  wins  losses  season
4     NL  Central  Pittsburgh  Pirates        31.5    55      94    2022

We also saw how to use the OR operator, `|`, to find all rows where the value equals A or B.

Or, the value is ONE OF those presented.

In [17]:
baseball_df.loc[ (baseball_df.Team == 'Cardinals') | (baseball_df.Team == 'Brewers'), : ]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central  Milwaukee    Brewers         7.5    79      70    2022

The `==` operator combined with `|` operator is correct to use...but it does not SCALE well!

For example, if we needed to check for 10 possible values...we would need to type in 10 different conditions!!!

Instead, we can use the `.isin()` method to streamline the `|` operator!

In [18]:
baseball_df.loc[ baseball_df.Team.isin(['Cardinals', 'Brewers']), :]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central  Milwaukee    Brewers         7.5    79      70    2022

In [19]:
baseball_df.loc[ baseball_df.Team.isin(['Cardinals', 'Brewers', 'Pirates']), :]

  League Division        City       Team  games_back  wins  losses  season
0     NL  Central   St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central   Milwaukee    Brewers         7.5    79      70    2022
4     NL  Central  Pittsburgh    Pirates        31.5    55      94    2022

The `.isin()` method can also be applied to numbers.

In [20]:
baseball_df.loc[ baseball_df.losses.isin([70, 90]), :]

  League Division        City     Team  games_back  wins  losses  season
1     NL  Central   Milwaukee  Brewers         7.5    79      70    2022
3     NL  Central  Cincinatti     Reds        27.5    59      90    2022

The `.isin()` operator is especially for string filtering!

In [21]:
top_teams = baseball_df.loc[ baseball_df.games_back < 10, 'Team'].copy().tolist()

In [22]:
top_teams

['Cardinals', 'Brewers']

In [23]:
baseball_df.loc[ baseball_df.Team.isin( top_teams ), : ]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022
1     NL  Central  Milwaukee    Brewers         7.5    79      70    2022

## String pattern matching

In [24]:
baseball_df.loc[ baseball_df.City == 'Pittsburgh', : ]

  League Division        City     Team  games_back  wins  losses  season
4     NL  Central  Pittsburgh  Pirates        31.5    55      94    2022

But what if I didn't feel like typing out the whole string for `'Pittsburgh'`?

In [25]:
baseball_df.loc[ baseball_df.City == 'Pitt', : ]

Empty DataFrame
Columns: [League, Division, City, Team, games_back, wins, losses, season]
Index: []

What if we had a typo?

In [26]:
baseball_df.loc[ baseball_df.City == 'Pittsburg', :]

Empty DataFrame
Columns: [League, Division, City, Team, games_back, wins, losses, season]
Index: []

Instead, we could instead focus on a PATTERN. The `.str.contains()` method searching for a PATTERN **WITHIN** the string!

In [27]:
baseball_df.City.str.contains('Pitt')

0    False
1    False
2    False
3    False
4     True
Name: City, dtype: bool

In [28]:
baseball_df.City

0     St. Louis
1     Milwaukee
2       Chicago
3    Cincinatti
4    Pittsburgh
Name: City, dtype: object

In [29]:
baseball_df.loc[ baseball_df.City.str.contains('Pitt'), : ]

  League Division        City     Team  games_back  wins  losses  season
4     NL  Central  Pittsburgh  Pirates        31.5    55      94    2022

We can even apply the PATTERN search to a single character!

In [30]:
baseball_df.loc[ baseball_df.City.str.contains('P'), :]

  League Division        City     Team  games_back  wins  losses  season
4     NL  Central  Pittsburgh  Pirates        31.5    55      94    2022

But...be CAREFUL! If the PATTERN is TOO SHORT...it will not uniquely identify the string you are looking for!

In [31]:
baseball_df.loc[ baseball_df.City.str.contains('C'), : ]

  League Division        City  Team  games_back  wins  losses  season
2     NL  Central     Chicago  Cubs        22.5    64      85    2022
3     NL  Central  Cincinatti  Reds        27.5    59      90    2022

The `.str.contains()` method is very helpful when EXPLORING data!

I particularly like to use it to search for non-letter characters.

To find a period in a string we need to search for the pattern `\\.`.

In [32]:
baseball_df.loc[ baseball_df.City.str.contains( '\\.' ), : ]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022

We can even search for a WHITE SPACE.

In [33]:
baseball_df.loc[ baseball_df.City.str.contains( ' ' ), :]

  League Division       City       Team  games_back  wins  losses  season
0     NL  Central  St. Louis  Cardinals         0.0    87      63    2022

There are many more STRING METHODS available. Many of the Pandas `.str.` methods are consistent with the base Python string methods.

In [34]:
dir( baseball_df.City.str )

['__annotations__',
 '__class__',
 '__delattr__',
 '__dict__',
 '__dir__',
 '__doc__',
 '__eq__',
 '__format__',
 '__frozen',
 '__ge__',
 '__getattribute__',
 '__getitem__',
 '__gt__',
 '__hash__',
 '__init__',
 '__init_subclass__',
 '__iter__',
 '__le__',
 '__lt__',
 '__module__',
 '__ne__',
 '__new__',
 '__reduce__',
 '__reduce_ex__',
 '__repr__',
 '__setattr__',
 '__sizeof__',
 '__str__',
 '__subclasshook__',
 '__weakref__',
 '_data',
 '_doc_args',
 '_freeze',
 '_get_series_list',
 '_index',
 '_inferred_dtype',
 '_is_categorical',
 '_is_string',
 '_name',
 '_orig',
 '_parent',
 '_validate',
 '_wrap_result',
 'capitalize',
 'casefold',
 'cat',
 'center',
 'contains',
 'count',
 'decode',
 'encode',
 'endswith',
 'extract',
 'extractall',
 'find',
 'findall',
 'fullmatch',
 'get',
 'get_dummies',
 'index',
 'isalnum',
 'isalpha',
 'isdecimal',
 'isdigit',
 'islower',
 'isnumeric',
 'isspace',
 'istitle',
 'isupper',
 'join',
 'len',
 'ljust',
 'lower',
 'lstrip',
 'match',
 'normalize',
 'pad',
 'partition',
 'removeprefix',
 'removesuffix',
 'repeat',
 'replace',
 'rfind',
 'rindex',
 'rjust',
 'rpartition',
 'rsplit',
 'rstrip',
 'slice',
 'slice_replace',
 'split',
 'startswith',
 'strip',
 'swapcase',
 'title',
 'translate',
 'upper',
 'wrap',
 'zfill']

# Read data into Pandas

## Import Modules

In [1]:
import numpy as np
import pandas as pd

## Preliminaries

Download the 4 files from Canvas into the SAME directory as this notebook!!!!!

Let's make sure the files were downloaded and saved within the correct location.

In [2]:
import os

In [3]:
os.listdir()

['.ipynb_checkpoints',
 'Example_A.csv',
 'Example_B.csv',
 'Example_C.csv',
 'Excel_Example_Data.xlsx',
 'week_05_filter_pandas_with_strings.html',
 'week_05_filter_pandas_with_strings.ipynb',
 'week_05_read_data.ipynb']

In [4]:
os.getcwd()

'C:\\Users\\jyurk\\Documents\\PittSCI\\PMDS\\ADDM\\courses\\CMPINF_2100\\publish\\cmpinf_2100_project\\week_05'

## Read Excel

In [5]:
pd.read_excel( 'Excel_Example_Data.xlsx' )

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

In [6]:
df0 = pd.read_excel( 'Excel_Example_Data.xlsx' )

In [7]:
%whos

Variable   Type         Data/Info
---------------------------------
df0        DataFrame        A   B     C    D   E <...> l  11 -1200  Dec  dd  20
np         module       <module 'numpy' from 'C:\<...>ges\\numpy\\__init__.py'>
os         module       <module 'os' from 'C:\\Us<...>\cmpinf2100\\lib\\os.py'>
pd         module       <module 'pandas' from 'C:<...>es\\pandas\\__init__.py'>

In [8]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     int64
 2   C       12 non-null     int64
 3   D       12 non-null     object
 4   E       12 non-null     object
 5   F       12 non-null     int64
dtypes: int64(3), object(3)
memory usage: 704.0+ bytes

In [9]:
df0.shape

(12, 6)

In [10]:
df0.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [11]:
df0.dtypes

A    object
B     int64
C     int64
D    object
E    object
F     int64
dtype: object

In [12]:
df0.index

RangeIndex(start=0, stop=12, step=1)

We can force one of the columns to be the `.index` attribute when the data are read.

In [13]:
df0_b = pd.read_excel( 'Excel_Example_Data.xlsx', index_col=0 )

In [14]:
df0_b

    B     C    D   E   F
A
a   0  -100  Jan  aa  10
b   1  -200  Feb  aa  20
c   2  -300  Mar  aa  10
d   3  -400  Apr  bb  20
e   4  -500  May  bb  10
f   5  -600  Jun  bb  20
g   6  -700  Jul  cc  10
h   7  -800  Aug  cc  20
i   8  -900  Sep  cc  10
j   9 -1000  Oct  dd  20
k  10 -1100  Nov  dd  10
l  11 -1200  Dec  dd  20

In [15]:
df0_b.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, a to l
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   B       12 non-null     int64
 1   C       12 non-null     int64
 2   D       12 non-null     object
 3   E       12 non-null     object
 4   F       12 non-null     int64
dtypes: int64(3), object(2)
memory usage: 576.0+ bytes

In [16]:
df0_b.index

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l'], dtype='object', name='A')

In [18]:
df0_b.loc[ 'a' ]

B       0
C    -100
D     Jan
E      aa
F      10
Name: a, dtype: object

In [19]:
df0_b.loc[ 'c' ]

B       2
C    -300
D     Mar
E      aa
F      10
Name: c, dtype: object

In [20]:
df0_b.shape

(12, 5)

We do not just need the zeroth column to be the attribute. It can be any column!

In [21]:
df0_c = pd.read_excel( 'Excel_Example_Data.xlsx', index_col=4 )

In [22]:
df0_c

    A   B     C    D   F
E
aa  a   0  -100  Jan  10
aa  b   1  -200  Feb  20
aa  c   2  -300  Mar  10
bb  d   3  -400  Apr  20
bb  e   4  -500  May  10
bb  f   5  -600  Jun  20
cc  g   6  -700  Jul  10
cc  h   7  -800  Aug  20
cc  i   8  -900  Sep  10
dd  j   9 -1000  Oct  20
dd  k  10 -1100  Nov  10
dd  l  11 -1200  Dec  20

In [23]:
df0_c.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12 entries, aa to dd
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     int64
 2   C       12 non-null     int64
 3   D       12 non-null     object
 4   F       12 non-null     int64
dtypes: int64(3), object(2)
memory usage: 576.0+ bytes

In [24]:
df0_c.loc[ 'aa' ]

    A  B    C    D   F
E
aa  a  0 -100  Jan  10
aa  b  1 -200  Feb  20
aa  c  2 -300  Mar  10

By default, NONE of the columns are treated as the `.index`.

In [25]:
df0_d = pd.read_excel( 'Excel_Example_Data.xlsx', index_col = None )

In [26]:
df0_d

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

In [27]:
df0_d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     int64
 2   C       12 non-null     int64
 3   D       12 non-null     object
 4   E       12 non-null     object
 5   F       12 non-null     int64
dtypes: int64(3), object(3)
memory usage: 704.0+ bytes

In [28]:
df0_d.index

RangeIndex(start=0, stop=12, step=1)

## Headers or Column names

By default, the `pd.read_*` family of functions ASSUMES the TOP row is the HEADER row!!!

The top row therefore does NOT contain VALUES!!! Instead, it is assumed the TOP ROW or HEADER ROW contains the COLUMN NAMES!

In [29]:
df0.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

In [30]:
df0.dtypes

A    object
B     int64
C     int64
D    object
E    object
F     int64
dtype: object

In [31]:
df0

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

But, let's see what happens if we work with a data set or a SHEET within an Excel workbook that does NOT use a header row!

When you know there is NO HEADER...then the `header` argument must be set to `None`.

In [32]:
df0_no_names = pd.read_excel( 'Excel_Example_Data.xlsx', sheet_name='no_headers', header=None )

In [33]:
df0_no_names

    0   1     2    3   4   5
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

In [34]:
df0_no_names.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       12 non-null     object
 1   1       12 non-null     int64
 2   2       12 non-null     int64
 3   3       12 non-null     object
 4   4       12 non-null     object
 5   5       12 non-null     int64
dtypes: int64(3), object(3)
memory usage: 704.0+ bytes

In [35]:
df0_no_names.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

If there is no header row, we can use the `names` argument to NAME the columns!

In [36]:
df0_no_names_2 = pd.read_excel( 'Excel_Example_Data.xlsx', 
                                sheet_name='no_headers',
                                header=None,
                                names=df0.columns)

In [37]:
df0_no_names_2

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

In [38]:
df0_no_names_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       12 non-null     object
 1   B       12 non-null     int64
 2   C       12 non-null     int64
 3   D       12 non-null     object
 4   E       12 non-null     object
 5   F       12 non-null     int64
dtypes: int64(3), object(3)
memory usage: 704.0+ bytes

But...be VERY careful...it there is a HEADER row and you specify that there isn't by mistake!!!!

In [39]:
df0_mistake = pd.read_excel( 'Excel_Example_Data.xlsx', header=None )

In [40]:
df0_mistake.shape

(13, 6)

In [41]:
df0_mistake.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       13 non-null     object
 1   1       13 non-null     object
 2   2       13 non-null     object
 3   3       13 non-null     object
 4   4       13 non-null     object
 5   5       13 non-null     object
dtypes: object(6)
memory usage: 752.0+ bytes

In [42]:
df0_mistake

    0   1      2    3   4   5
0   A   B      C    D   E   F
1   a   0   -100  Jan  aa  10
2   b   1   -200  Feb  aa  20
3   c   2   -300  Mar  aa  10
4   d   3   -400  Apr  bb  20
5   e   4   -500  May  bb  10
6   f   5   -600  Jun  bb  20
7   g   6   -700  Jul  cc  10
8   h   7   -800  Aug  cc  20
9   i   8   -900  Sep  cc  10
10  j   9  -1000  Oct  dd  20
11  k  10  -1100  Nov  dd  10
12  l  11  -1200  Dec  dd  20

In [43]:
df0_mistake.dtypes

0    object
1    object
2    object
3    object
4    object
5    object
dtype: object

In [44]:
df0.dtypes

A    object
B     int64
C     int64
D    object
E    object
F     int64
dtype: object

In [45]:
df0_mistake.columns

Int64Index([0, 1, 2, 3, 4, 5], dtype='int64')

In [46]:
df0.columns

Index(['A', 'B', 'C', 'D', 'E', 'F'], dtype='object')

## Read other sheets

Just specify the `sheet_name` argument appropriately.

In [47]:
pd.read_excel( 'Excel_Example_Data.xlsx', sheet_name='ExB' )

    E    G
0  aa  100
1  bb  200
2  dd  400

In [48]:
pd.read_excel( 'Excel_Example_Data.xlsx', sheet_name='ExC' )

    F    H
0  10  AAA
1  20  BBB
2  30  CCC
3  40  DDD

## Read CSV

CSV files have the extension `.csv`. Unlike Excel workbooks they contain a single spread sheet rather than multiple spread sheets.

In [49]:
pd.read_csv( 'Example_A.csv' )

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

`pd.read_csv()` has nearly all the same arguments as `pd.read_excel()`!!!

In [51]:
pd.read_csv( 'Example_A.csv', index_col=0)

    B     C    D   E   F
A
a   0  -100  Jan  aa  10
b   1  -200  Feb  aa  20
c   2  -300  Mar  aa  10
d   3  -400  Apr  bb  20
e   4  -500  May  bb  10
f   5  -600  Jun  bb  20
g   6  -700  Jul  cc  10
h   7  -800  Aug  cc  20
i   8  -900  Sep  cc  10
j   9 -1000  Oct  dd  20
k  10 -1100  Nov  dd  10
l  11 -1200  Dec  dd  20

But a few other important arguments that you may need.

We can specify the MAX NUMBER of rows to read.

In [52]:
pd.read_csv( 'Example_A.csv', nrows=3 )

   A  B    C    D   E   F
0  a  0 -100  Jan  aa  10
1  b  1 -200  Feb  aa  20
2  c  2 -300  Mar  aa  10

We can also skip rows.

In [53]:
pd.read_csv( 'Example_A.csv', skiprows=2 )

   b   1  -200  Feb  aa  20
0  c   2  -300  Mar  aa  10
1  d   3  -400  Apr  bb  20
2  e   4  -500  May  bb  10
3  f   5  -600  Jun  bb  20
4  g   6  -700  Jul  cc  10
5  h   7  -800  Aug  cc  20
6  i   8  -900  Sep  cc  10
7  j   9 -1000  Oct  dd  20
8  k  10 -1100  Nov  dd  10
9  l  11 -1200  Dec  dd  20

When you skip rows...be very careful with the HEADER !!!

In [54]:
pd.read_csv( 'Example_A.csv', skiprows=2, header=None )

    0   1     2    3   4   5
0   b   1  -200  Feb  aa  20
1   c   2  -300  Mar  aa  10
2   d   3  -400  Apr  bb  20
3   e   4  -500  May  bb  10
4   f   5  -600  Jun  bb  20
5   g   6  -700  Jul  cc  10
6   h   7  -800  Aug  cc  20
7   i   8  -900  Sep  cc  10
8   j   9 -1000  Oct  dd  20
9   k  10 -1100  Nov  dd  10
10  l  11 -1200  Dec  dd  20

Read in the 3 CSV files and assign them to different objects.

In [55]:
dfA = pd.read_csv( 'Example_A.csv' )

In [56]:
dfB = pd.read_csv( 'Example_B.csv' )

In [57]:
dfC = pd.read_csv( 'Example_C.csv' )

In [58]:
dfA

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

In [59]:
dfB

    E    G
0  aa  100
1  bb  200
2  dd  400

In [60]:
dfC

    F    H
0  10  AAA
1  20  BBB
2  30  CCC
3  40  DDD

## Read or download from a website

The data might be located at a web address or URL.

In [61]:
gap_url = 'https://raw.githubusercontent.com/chendaniely/pandas_for_everyone/master/data/gapminder.tsv'

In [62]:
type( gap_url )

str

To read in the data we provide the URL web address as a string instead of a file name on our computer!

Because we are reading a TAB separated rather than a CSV...we need to change the `sep` argument.

In [63]:
gap_df = pd.read_csv( gap_url, sep = '\t' )

In [64]:
gap_df.shape

(1704, 6)

In [65]:
gap_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

## Read or load data from Modules

We will use data from Modules throughout the ADDM program.

We just need to make sure the module is imported!

In [66]:
import seaborn as sns

In [67]:
titanic = sns.load_dataset( 'titanic' )

In [68]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    category
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    category
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 80.7+ KB

# Combine DataFrames - Concatenation

## Import Modules

In [1]:
import numpy as np
import pandas as pd

## Read data

Read in the Example A CSV file discussed in the previous recording.

In [2]:
dfA0 = pd.read_csv( 'Example_A.csv' )

In [3]:
dfA0

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

Add a column with a constant value of 0.

In [4]:
dfA0['attempt'] = 0

In [5]:
dfA0

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0
1   b   1  -200  Feb  aa  20        0
2   c   2  -300  Mar  aa  10        0
3   d   3  -400  Apr  bb  20        0
4   e   4  -500  May  bb  10        0
5   f   5  -600  Jun  bb  20        0
6   g   6  -700  Jul  cc  10        0
7   h   7  -800  Aug  cc  20        0
8   i   8  -900  Sep  cc  10        0
9   j   9 -1000  Oct  dd  20        0
10  k  10 -1100  Nov  dd  10        0
11  l  11 -1200  Dec  dd  20        0

Read in the same CSV file again!

In [6]:
dfA1 = pd.read_csv( 'Example_A.csv' )

In [7]:
dfA1

    A   B     C    D   E   F
0   a   0  -100  Jan  aa  10
1   b   1  -200  Feb  aa  20
2   c   2  -300  Mar  aa  10
3   d   3  -400  Apr  bb  20
4   e   4  -500  May  bb  10
5   f   5  -600  Jun  bb  20
6   g   6  -700  Jul  cc  10
7   h   7  -800  Aug  cc  20
8   i   8  -900  Sep  cc  10
9   j   9 -1000  Oct  dd  20
10  k  10 -1100  Nov  dd  10
11  l  11 -1200  Dec  dd  20

Add a constant but this time equal to 1.

In [8]:
dfA1['attempt'] = 1

In [9]:
dfA1

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        1
1   b   1  -200  Feb  aa  20        1
2   c   2  -300  Mar  aa  10        1
3   d   3  -400  Apr  bb  20        1
4   e   4  -500  May  bb  10        1
5   f   5  -600  Jun  bb  20        1
6   g   6  -700  Jul  cc  10        1
7   h   7  -800  Aug  cc  20        1
8   i   8  -900  Sep  cc  10        1
9   j   9 -1000  Oct  dd  20        1
10  k  10 -1100  Nov  dd  10        1
11  l  11 -1200  Dec  dd  20        1

## Vertically Concatenate

Vertically combining means we STACK the objects on top of each other.

In [10]:
pd.concat( [dfA0, dfA1] )

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0
1   b   1  -200  Feb  aa  20        0
2   c   2  -300  Mar  aa  10        0
3   d   3  -400  Apr  bb  20        0
4   e   4  -500  May  bb  10        0
5   f   5  -600  Jun  bb  20        0
6   g   6  -700  Jul  cc  10        0
7   h   7  -800  Aug  cc  20        0
8   i   8  -900  Sep  cc  10        0
9   j   9 -1000  Oct  dd  20        0
10  k  10 -1100  Nov  dd  10        0
11  l  11 -1200  Dec  dd  20        0
0   a   0  -100  Jan  aa  10        1
1   b   1  -200  Feb  aa  20        1
2   c   2  -300  Mar  aa  10        1
3   d   3  -400  Apr  bb  20        1
4   e   4  -500  May  bb  10        1
5   f   5  -600  Jun  bb  20        1
6   g   6  -700  Jul  cc  10        1
7   h   7  -800  Aug  cc  20        1
8   i   8  -900  Sep  cc  10        1
9   j   9 -1000  Oct  dd  20        1
10  k  10 -1100  Nov  dd  10        1
11  l  11 -1200  Dec  dd  20        1

This works because BOTH DataFrames have the SAME colum names!

In [11]:
dfA0.columns == dfA1.columns

array([ True,  True,  True,  True,  True,  True,  True])

Look closely at the `.index` attribute of the COMBINED VERTICALLY STACKED DataFrames!

In [12]:
pd.concat( [dfA0, dfA1] ).loc[ 10 ]

    A   B     C    D   E   F  attempt
10  k  10 -1100  Nov  dd  10        0
10  k  10 -1100  Nov  dd  10        1

By default, the `.index` attribute is allowed to repeat. The `.index` does NOT uniquely define a row in the new stacked DataFrame!

Ignoring the index allows each stacked row to be unique!

In [13]:
pd.concat( [dfA0, dfA1], ignore_index=True)

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0
1   b   1  -200  Feb  aa  20        0
2   c   2  -300  Mar  aa  10        0
3   d   3  -400  Apr  bb  20        0
4   e   4  -500  May  bb  10        0
5   f   5  -600  Jun  bb  20        0
6   g   6  -700  Jul  cc  10        0
7   h   7  -800  Aug  cc  20        0
8   i   8  -900  Sep  cc  10        0
9   j   9 -1000  Oct  dd  20        0
10  k  10 -1100  Nov  dd  10        0
11  l  11 -1200  Dec  dd  20        0
12  a   0  -100  Jan  aa  10        1
13  b   1  -200  Feb  aa  20        1
14  c   2  -300  Mar  aa  10        1
15  d   3  -400  Apr  bb  20        1
16  e   4  -500  May  bb  10        1
17  f   5  -600  Jun  bb  20        1
18  g   6  -700  Jul  cc  10        1
19  h   7  -800  Aug  cc  20        1
20  i   8  -900  Sep  cc  10        1
21  j   9 -1000  Oct  dd  20        1
22  k  10 -1100  Nov  dd  10        1
23  l  11 -1200  Dec  dd  20        1

I also like to force the DEEP COPY as a just in case.

In [14]:
pd.concat([dfA0, dfA1], ignore_index=True, copy=True)

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0
1   b   1  -200  Feb  aa  20        0
2   c   2  -300  Mar  aa  10        0
3   d   3  -400  Apr  bb  20        0
4   e   4  -500  May  bb  10        0
5   f   5  -600  Jun  bb  20        0
6   g   6  -700  Jul  cc  10        0
7   h   7  -800  Aug  cc  20        0
8   i   8  -900  Sep  cc  10        0
9   j   9 -1000  Oct  dd  20        0
10  k  10 -1100  Nov  dd  10        0
11  l  11 -1200  Dec  dd  20        0
12  a   0  -100  Jan  aa  10        1
13  b   1  -200  Feb  aa  20        1
14  c   2  -300  Mar  aa  10        1
15  d   3  -400  Apr  bb  20        1
16  e   4  -500  May  bb  10        1
17  f   5  -600  Jun  bb  20        1
18  g   6  -700  Jul  cc  10        1
19  h   7  -800  Aug  cc  20        1
20  i   8  -900  Sep  cc  10        1
21  j   9 -1000  Oct  dd  20        1
22  k  10 -1100  Nov  dd  10        1
23  l  11 -1200  Dec  dd  20        1

We can assign the result to an object.

In [15]:
dfA_double = pd.concat( [dfA0, dfA1], ignore_index=True, copy=True)

In [16]:
dfA_double.shape

(24, 7)

In [17]:
dfA0.shape

(12, 7)

In [18]:
dfA1.shape

(12, 7)

## Horizontal Concatenation

BINDING columns together!

The default `axis` argument is ZERO meaning the DATAFRAMES are VERTICALLY combined!

In [19]:
pd.concat([dfA0, dfA1], axis=0)

    A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0
1   b   1  -200  Feb  aa  20        0
2   c   2  -300  Mar  aa  10        0
3   d   3  -400  Apr  bb  20        0
4   e   4  -500  May  bb  10        0
5   f   5  -600  Jun  bb  20        0
6   g   6  -700  Jul  cc  10        0
7   h   7  -800  Aug  cc  20        0
8   i   8  -900  Sep  cc  10        0
9   j   9 -1000  Oct  dd  20        0
10  k  10 -1100  Nov  dd  10        0
11  l  11 -1200  Dec  dd  20        0
0   a   0  -100  Jan  aa  10        1
1   b   1  -200  Feb  aa  20        1
2   c   2  -300  Mar  aa  10        1
3   d   3  -400  Apr  bb  20        1
4   e   4  -500  May  bb  10        1
5   f   5  -600  Jun  bb  20        1
6   g   6  -700  Jul  cc  10        1
7   h   7  -800  Aug  cc  20        1
8   i   8  -900  Sep  cc  10        1
9   j   9 -1000  Oct  dd  20        1
10  k  10 -1100  Nov  dd  10        1
11  l  11 -1200  Dec  dd  20        1

If we change `axis` to `axis=1` then the two DataFrames will be combined HORIZONTALLY!!!!!

In [20]:
pd.concat( [dfA0, dfA1], axis=1 )

    A   B     C    D   E   F  attempt  A   B     C    D   E   F  attempt
0   a   0  -100  Jan  aa  10        0  a   0  -100  Jan  aa  10        1
1   b   1  -200  Feb  aa  20        0  b   1  -200  Feb  aa  20        1
2   c   2  -300  Mar  aa  10        0  c   2  -300  Mar  aa  10        1
3   d   3  -400  Apr  bb  20        0  d   3  -400  Apr  bb  20        1
4   e   4  -500  May  bb  10        0  e   4  -500  May  bb  10        1
5   f   5  -600  Jun  bb  20        0  f   5  -600  Jun  bb  20        1
6   g   6  -700  Jul  cc  10        0  g   6  -700  Jul  cc  10        1
7   h   7  -800  Aug  cc  20        0  h   7  -800  Aug  cc  20        1
8   i   8  -900  Sep  cc  10        0  i   8  -900  Sep  cc  10        1
9   j   9 -1000  Oct  dd  20        0  j   9 -1000  Oct  dd  20        1
10  k  10 -1100  Nov  dd  10        0  k  10 -1100  Nov  dd  10        1
11  l  11 -1200  Dec  dd  20        0  l  11 -1200  Dec  dd  20        1

In [21]:
pd.concat( [dfA0, dfA1], axis=1 ).columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'attempt', 'A', 'B', 'C', 'D', 'E', 'F',
       'attempt'],
      dtype='object')

The column names are NO LONGER UNIQUE!!!!

In [22]:
pd.concat( [dfA0, dfA1], axis=1).loc[ :, ['A', 'B'] ]

    A  A   B   B
0   a  a   0   0
1   b  b   1   1
2   c  c   2   2
3   d  d   3   3
4   e  e   4   4
5   f  f   5   5
6   g  g   6   6
7   h  h   7   7
8   i  i   8   8
9   j  j   9   9
10  k  k  10  10
11  l  l  11  11

I think this is VERY BAD. I really dislike that Pandas allows combining DataFrames horizontally even if they have the SAME COLUMN NAMES!!!!!

Be careful when you horizontally combine!!!!!

So why would we ever horizontally combine?

In [23]:
dfA_left = dfA0.loc[ :, dfA0.columns[:3] ].copy()

In [24]:
dfA_left

    A   B     C
0   a   0  -100
1   b   1  -200
2   c   2  -300
3   d   3  -400
4   e   4  -500
5   f   5  -600
6   g   6  -700
7   h   7  -800
8   i   8  -900
9   j   9 -1000
10  k  10 -1100
11  l  11 -1200

In [25]:
dfA_right = dfA0.loc[ :, dfA0.columns[-2:]].copy()

In [26]:
dfA_right

     F  attempt
0   10        0
1   20        0
2   10        0
3   20        0
4   10        0
5   20        0
6   10        0
7   20        0
8   10        0
9   20        0
10  10        0
11  20        0

In [27]:
dfA_left.shape

(12, 3)

In [28]:
dfA_right.shape

(12, 2)

The point of horizontally combining is to bring together DIFFERENT columns that have the SAME number of rows!

In [29]:
pd.concat( [dfA_left, dfA_right], axis=1)

    A   B     C   F  attempt
0   a   0  -100  10        0
1   b   1  -200  20        0
2   c   2  -300  10        0
3   d   3  -400  20        0
4   e   4  -500  10        0
5   f   5  -600  20        0
6   g   6  -700  10        0
7   h   7  -800  20        0
8   i   8  -900  10        0
9   j   9 -1000  20        0
10  k  10 -1100  10        0
11  l  11 -1200  20        0

BUT...be careful...if you ignore the index with horizontal concatenation...you will REMOVE the column names!!!

In [30]:
pd.concat([dfA_left, dfA_right], axis=1, ignore_index=True)

    0   1     2   3  4
0   a   0  -100  10  0
1   b   1  -200  20  0
2   c   2  -300  10  0
3   d   3  -400  20  0
4   e   4  -500  10  0
5   f   5  -600  20  0
6   g   6  -700  10  0
7   h   7  -800  20  0
8   i   8  -900  10  0
9   j   9 -1000  20  0
10  k  10 -1100  10  0
11  l  11 -1200  20  0

# Begin Exploring Data by Summarizing Pandas Series

We will Explore data before training predictive models. This process is known as Exploratory Data Analysis (EDA).

An important aspect of EDA is knowing how to calculate SUMMARY STATISTICS. This notebook demonstrates how to summarize Pandas Series.

## Import Modules

In [1]:
import numpy as np
import pandas as pd

## Review NumPy summary methods

Let's create a list of integers and then convert that list to a 1D NumPy array.

In [2]:
my_list = [10, 20, 30, 40, 50, 60, 70, 80]

Convert to an array.

In [3]:
my_array = np.array( my_list )

In [4]:
my_array.mean()

45.0

In [5]:
my_array.var(ddof=1)

600.0

In [6]:
my_array.std(ddof=1)

24.49489742783178

In [7]:
my_array.min()

10

In [8]:
my_array.max()

80

## Pandas Series - summary methods

Convert the list into a Pandas Series.

In [9]:
my_series = pd.Series( my_list )

Most of the Pandas Series summary methods work very similarly to their NumPy counterparts!

In [10]:
my_series.mean()

45.0

In [11]:
my_series.min()

10

In [12]:
my_series.max()

80

BUT...LOOK CLOSELY...at the VARIANCE!!!!

In [13]:
my_series.var()

600.0

In [14]:
my_array.var()

525.0

In [15]:
my_array.var(ddof=1)

600.0

Look closely at the standard deviation!!!

In [16]:
my_series.std()

24.49489742783178

In [17]:
my_array.std()

22.9128784747792

In [18]:
my_array.std(ddof=1)

24.49489742783178

Pandas CORRECTLY sets `ddof=1` when the variance or standard deviation are calculated!!!

Pandas calculates the UNBIASED estimate to variance and standard deviation!!!

### Unique values

We can get the number of unique values for a Pandas Series!

In [19]:
my_series.nunique()

8

In [20]:
my_series

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
dtype: int64

In [21]:
my_series.size

8

Knowing the number of unique values is especially important for CATEGORICAL or STRING variables!

In [22]:
my_series_b = pd.Series( ['A', 'A', 'A', 'B', 'B', 'B', 'C', 'D', 'D'])

In [23]:
my_series_b

0    A
1    A
2    A
3    B
4    B
5    B
6    C
7    D
8    D
dtype: object

In [24]:
my_series_b.size

9

In [25]:
my_series_b.shape

(9,)

In [26]:
my_series_b.nunique()

4

The number of unique values does NOT need to equal the number of elements or SIZE!!!!

My favorite Pandas method focuses on dealing with unique values!!!

Often times we want to COUNT the number of times a unique value occurs!

In [27]:
my_series_b.value_counts()

A    3
B    3
D    2
C    1
dtype: int64

The COUNTS give us more information than just the unique values.

In [28]:
my_series_b.value_counts().index

Index(['A', 'B', 'D', 'C'], dtype='object')

If you just want the unique values, then you can use the `.unique()` method.

In [29]:
my_series_b.unique()

array(['A', 'B', 'C', 'D'], dtype=object)

## Summarize individual columns within DataFrames

This is to reinforce the fact that COLUMNS are really Pandas Series within a DataFrame.

Let's read in the JOINED DATA set we created previously.

In [30]:
df = pd.read_csv('joined_data.csv')

In [31]:
df

      A     B       C    D    E   F      G    H
0     a   0.0  -100.0  Jan   aa  10  100.0  AAA
1     b   1.0  -200.0  Feb   aa  20  100.0  BBB
2     c   2.0  -300.0  Mar   aa  10  100.0  AAA
3     d   3.0  -400.0  Apr   bb  20  200.0  BBB
4     e   4.0  -500.0  May   bb  10  200.0  AAA
5     f   5.0  -600.0  Jun   bb  20  200.0  BBB
6     g   6.0  -700.0  Jul   cc  10    NaN  AAA
7     h   7.0  -800.0  Aug   cc  20    NaN  BBB
8     i   8.0  -900.0  Sep   cc  10    NaN  AAA
9     j   9.0 -1000.0  Oct   dd  20  400.0  BBB
10    k  10.0 -1100.0  Nov   dd  10  400.0  AAA
11    l  11.0 -1200.0  Dec   dd  20  400.0  BBB
12  NaN   NaN     NaN  NaN  NaN  30    NaN  CCC
13  NaN   NaN     NaN  NaN  NaN  40    NaN  DDD

Access any COLUMN and APPLY summary methods just like it was a "regular" Pandas Series in the environment.

In [32]:
df.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'], dtype='object')

In [33]:
df.dtypes

A     object
B    float64
C    float64
D     object
E     object
F      int64
G    float64
H     object
dtype: object

In [34]:
df['A']

0       a
1       b
2       c
3       d
4       e
5       f
6       g
7       h
8       i
9       j
10      k
11      l
12    NaN
13    NaN
Name: A, dtype: object

In [35]:
df['A'].nunique()

12

In [36]:
df.A.nunique()

12

In [37]:
df.D.nunique()

12

In [38]:
df.E.nunique()

4

In [39]:
df.F.nunique()

4

In [40]:
df.G.nunique()

3

Can apply summary methods like `.mean()` and `.std()` to any numeric column!

In [41]:
df.dtypes

A     object
B    float64
C    float64
D     object
E     object
F      int64
G    float64
H     object
dtype: object

In [42]:
df.F.mean()

17.857142857142858

In [43]:
df['F'].mean()

17.857142857142858

In [44]:
df.F.std()

8.92582375303981

In [45]:
df['F'].std()

8.92582375303981

We can also calculate the STANDARD ERROR ON THE MEAN (SEM)!!!

In [46]:
df.F.std() / np.sqrt( df.F.size )

2.385526741328836

In [47]:
df.F.sem()

2.385526741328836